Revit 2027 API
Marble Class
 A static class that provides access to the property names that appear in the Marble visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Marble
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Marble
Public NotInheritable Class Marble
public ref class Marble abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Marble = class end
The Marble type exposes the following members.
Properties
Name | Description
MarbleColor1 |  The property labeled "Stone Color" from the "Marble" schema.
MarbleColor2 |  The property labeled "Vein Color" from the "Marble" schema.
MarbleSize |  The property labeled "Vein Spacing" from the "Marble" schema.
MarbleWidth |  The property labeled "Vein Width" from the "Marble" schema.
TextureAngle |  The property labeled "Angle" from the "Marble" schema.
TextureLinkTextureTransforms |  The property labeled "Link Transforms" from the "Marble" schema.
TextureRealWorldOffsetX |  The property labeled "Offset X" from the "Marble" schema.
TextureRealWorldOffsetY |  The property labeled "Offset Y" from the "Marble" schema.
TextureRealWorldOffsetZ |  The property labeled "Offset Z" from the "Marble" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace